#+TITLE: Spacemacs Frequently Used Shortcuts

* Terminology
  This is how to read the different shortcuts.
** M - alt
** C - ctrl
** Spc - Spacebar
** C-v = Ctrl+v
* Basic Emacs Usage
** Copy - ~M-w~
** Paste - ~C-y~
** Cut - ~C-w~
* Capture Stuff
** Copy Link of current file - ~C-c l~
** Insert Link - ~C-c C-l~
** Insert new Capture - ~Spc a o c~  
** Insert New Journal ~Spc a o j~
* Timekeeping
** Clock in - ~Spc m C i~
** Clock out - ~Spc m C o~
** Pomodoro - ~Spc m C p~
* Clock Table Templates
** [[https://orgmode.org/manual/The-clock-table.html][Documentation]] 
** Summary of tasks done today
#+BEGIN: clocktable :scope agenda-with-archives :block today :fileskip0 :stepskip0
#+CAPTION: Clock summary at [2019-07-18 Thu 15:21], for Thursday, July 18, 2019.
| File     | Headline                  | Time   |      |
|----------+---------------------------+--------+------|
|          | ALL *Total time*          | *1:35* |      |
|----------+---------------------------+--------+------|
| TODO.org | *File time*               | *1:35* |      |
|          | Tickets                   | 1:15   |      |
|          | \_  SDLC-328              |        | 1:15 |
|          | Tasks                     | 0:20   |      |
|          | \_  Personal Journal Time |        | 0:20 |
#+END:
** Summary of tasks done last week
#+BEGIN: clocktable :scope agenda-with-archives :block thisweek :step day :fileskip0 :stepskip0

Daily report: [2019-07-15 Mon]
| File     | Headline         | Time   |      |
|----------+------------------+--------+------|
|          | ALL *Total time* | *0:25* |      |
|----------+------------------+--------+------|
| todo.org | *File time*      | *0:25* |      |
|          | Tasks            | 0:25   |      |
|          | \_  Journal Time |        | 0:25 |

Daily report: [2019-07-16 Tue]
| File     | Headline                                     | Time   |      |
|----------+----------------------------------------------+--------+------|
|          | ALL *Total time*                             | *2:38* |      |
|----------+----------------------------------------------+--------+------|
| TODO.org | *File time*                                  | *2:04* |      |
|          | Tasks                                        | 2:04   |      |
|          | \_  Create Presentation about Jenkins for... |        | 0:13 |
|          | \_  Add Jenkins Powerpoint Slide about...    |        | 0:25 |
|          | \_  BKLG-17458...                            |        | 1:26 |
|----------+----------------------------------------------+--------+------|
| todo.org | *File time*                                  | *0:34* |      |
|          | Tasks                                        | 0:34   |      |
|          | \_  Cancel Paula's Universal Annual Pass     |        | 0:09 |
|          | \_  Journal Time                             |        | 0:25 |

Daily report: [2019-07-17 Wed]
| File     | Headline         | Time   |      |
|----------+------------------+--------+------|
|          | ALL *Total time* | *1:15* |      |
|----------+------------------+--------+------|
| TODO.org | *File time*      | *0:50* |      |
|          | Tickets          | 0:50   |      |
|          | \_  SDLC-328     |        | 0:50 |
|----------+------------------+--------+------|
| todo.org | *File time*      | *0:25* |      |
|          | Tasks            | 0:25   |      |
|          | \_  Journal Time |        | 0:25 |

Daily report: [2019-07-18 Thu]
| File     | Headline                  | Time   |      |
|----------+---------------------------+--------+------|
|          | ALL *Total time*          | *1:35* |      |
|----------+---------------------------+--------+------|
| TODO.org | *File time*               | *1:35* |      |
|          | Tickets                   | 1:15   |      |
|          | \_  SDLC-328              |        | 1:15 |
|          | Tasks                     | 0:20   |      |
|          | \_  Personal Journal Time |        | 0:20 |

Daily report: [2019-07-19 Fri]
| File | Headline         | Time   |
|------+------------------+--------|
|      | ALL *Total time* | *0:00* |

Daily report: [2019-07-20 Sat]
| File | Headline         | Time   |
|------+------------------+--------|
|      | ALL *Total time* | *0:00* |

Daily report: [2019-07-21 Sun]
| File | Headline         | Time   |
|------+------------------+--------|
|      | ALL *Total time* | *0:00* |
#+END:
